# Hiring Process Analytics

1. Impoting all the libraries

In [4]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

2. Loading the CSV file

In [8]:
df= pd.read_csv("Statistics - Sheet1.csv")
df

,application_id,Interview Taken on,Status,event_name,Department,Post Name,Offered Salary
0,383422,5/1/14 11:40,Hired,Male,Service Department,c8,56553.0
1,907518,5/6/14 8:08,Hired,Female,Service Department,c5,22075.0
2,176719,5/6/14 8:08,Rejected,Male,Service Department,c5,70069.0
3,429799,5/2/14 16:28,Rejected,Female,Operations Department,i4,3207.0
4,253651,5/2/14 16:32,Hired,Male,Operations Department,i4,29668.0
...,...,...,...,...,...,...,...
7163,493131,8/28/14 17:32,Hired,Male,Service Department,c9,49282.0
7164,214261,8/31/14 1:36,Hired,Female,Service Department,c5,57742.0
7165,932441,8/31/14 1:37,Hired,Male,Service Department,c5,69932.0
7166,39010,8/31/14 1:38,Rejected,Male,Service Department,c5,14489.0
7167,686055,8/26/14 12:14,Hired,Male,Operations Department,c5,54201.0

# Preprocessing
1. Cleaning the data
    * Checking for duplicate values
    * Finding irrelevant columns
    * Finding/ determining null values

* Checking for duplicate values

In [9]:
df.duplicated().sum()

0

>> There are no duplicate values

* Finding irrelevant columns

In [10]:
df.keys()

Index(['application_id', 'Interview Taken on', 'Status', 'event_name',
       'Department', 'Post Name', 'Offered Salary'],
      dtype='object')

>> There are no irrelevant columns

* Checking for NULL values

In [11]:
df.isnull().sum()

application_id        0
Interview Taken on    0
Status                0
event_name            0
Department            0
Post Name             0
Offered Salary        1
dtype: int64

> Only one null cell found
>> filling the cell with the mean

In [13]:
df['Offered Salary'].describe()

count      7167.000000
mean      49983.029022
std       28854.176890
min         100.000000
25%       25460.500000
50%       49625.000000
75%       74438.000000
max      400000.000000
Name: Offered Salary, dtype: float64

In [14]:
df['Offered Salary'].fillna(49983, inplace=True)